Today was an alright day, I suppose. English period 1 we talked about Out of the Cradle Endlessly Rocking by Walt Whitman. I was paired with Fio, which was awkward, but not as awkward as I expected it to be. We had a nice disagreement over whether or not Whitman saw death in an erotic light, or rather merely a romantic/nurturing one. It was Hannah’s birthday today! That was neat. Lucas and Fio bought her flowers, which was a nice gesture. After that I had the poetry reading by Jeffrey Yang, which was fun. Lunch MUN club was cancelled. I sat with Kimi, and Hannah made jokes like three times about us being together. What a pissoff, honestly haha. Last period was Econ, and I took my quantitative test. Hoooooly fuck was that hard; a lot of it was on micro, and I wasn’t in Econ HL during the microeconomics section so I didn’t get any studying for that down. Rough, but we’ll see how it goes. On my Paper 1 I got 39/50 so a lowish 7, even though I kinda talked a lot about Marxism instead of evaluating economically. I texted Fio about that and she said ‘I feel as though I am partially to blame’ which was really cute. D’aww I miss her so much honestly. I wish that I could just go back in time and told myself to NOT TELL SOHEYLA HOW I FEEL. I’m bad at getting angry at people who betray me, I feel like. That happened with Soheyla, and also about Alexis. He lied to me and really fucked me over, but for some reason I can’t be mad at him either. I can’t be mad at Fio, but that’s a good thing because she didn’t even do anything besides react weirdly when she found out how I felt about her haha. That’s a bit whack though; I always make sure to be extra nice to people whom I know like me, like Leonie and Liza :( I even went out with Liza to the museum that one time. Whatever. After school was Indian culture night, which was pretty neat but THREE HOURS LONG. Kimi said that calculus was invented in India though, and that was FAKE NEWS so I didn’t like it. After that I worked on my MUN resolution for a long time. The first and only clause in it was two pages long.