So, today was the Cosmopolitan MUN conference. Just about every aspect of that was fairly painful. First, the obvious bit about Fio being everywhere. Then, the part where Lucas, Lizzie, Soheyla, Fio, and Tinna were very clearly a completely insular group. I was completely Chantal’d at every turn, so I became more awkward and distant, which only increased the isolation. Soheyla was nice to me in the beginning, and we talked a fair bit. I accidentally mentioned something about Alsace-Lorraine as a joke, and then I felt really awkward because Lizzie and Jess started talking about how smart I must be. I hate hate hate hate hat hate when people think that I’m just doing stuff or saying stuff to make myself look more intelligent. In the period 1 math quiz on trig, Fio finished super early and for the entire rest of the time I felt so inadequate. I know that she’s better at math than I am, but I was still clenching my fist so tightly. Something that I HATE even more than almost anything else is feeling inferior to people. In MUN it was alright, except that I wasn’t given a chance to give a speech defending my resolution, and actually it only had one clause struck before being passed. I work for over two hours on that resolution, and then the debating of it is over in under ten minutes. Now the four of them are sitting together in the subway, going around and playing a word-association game in a circle while I’m just sitting over here alone. When Fio left it got nicer. I’m wondering what she’s told them about me. This feeling of helplessness really hurts me, but there isn’t anything that I can do about it. I can’t believe that I trusted Soheyla. I can’t believe that I’m not angry at her. I don’t understand why she would do something like that to me. It really hurts me. Now I’ve got the great pleasure of writing over two thousand words for my ToK essay and my EE Reflection! How fun... I’m absolutely miserable. I keep thinking about Fio, and I keep remembering the way that I used to think about her. I want something to take that away, some way to forget how I used to see her and the pain that I feel when I see her or think about her now.