So my mind is pretty much an enormous pool of muck right about now. Dagny called me last night after I sent her The Trouble with Requited Love ep. II, and she repeated that she absolutely doesn’t want me to feel like I’m the ‘safe option.’ She told me that she loved me, which was... very nice to hear. I’ve never been told that in a romantic context before, so it was especially meaningful. She said that she doesn’t want me to be with someone who can’t make me their #1 priority, and because she can’t do that right now (because she wants to talk to other guys to take control of her sexuality) she doesn’t want to hurt me. I can’t lie and say that I understand it, but I can say that I love her, and I trust that she’s doing the right thing for her future right now, because nobody knows what’s best for Dagny other than Dagny herself.

Anyways, step 1 on the road to taking control of her sexuality seems to be getting closer with Finn Paisley, who honestly seems like a pretty cool dude. My first impressions of him in the Int’l group chat weren’t great, truth be told, but if Dagny likes him then he must be a pretty swell guy. I think it’s fantastic for her that she’s able to start flirting with another guy so quickly, but I just wish she hadn’t mentioned him to me that first time. Now whenever I go to text her something and see that she’s already online talking to him, my heart drops a little bit and I end up deleting whatever I was going to send. Did you know that she deleted that picture of the two of us from her finsta, so that she’d be able to add him without him getting confused about her availability? Well, not a picture of the two of us, but that picture of Bonnie and Clyde that she pasted our faces onto. Here, I’ll attach it on the next page in case you’ve forgotten. Isn’t that such a sweet photo? The angles of our heads, our expressions — I found it really cute.

EDIT: it was actually a different picture, but I’d forgotten. The correct one is attached. 

I guess I’m turning the page on the Dagny chapter of my life for now, smitten as I may be.

Next steps for me, on my own road to getting over these painful feelings?
1. Keep Dagny’s chat archived on WhatsApp so that I’m not constantly reminded of her. And change her contact name back to ‘Dagny Carlsson’ already!
2. Try to find Stanford girls to talk to on Instagram, WITHOUT letting Dagny know!! she doesn’t know how much the Finn thing is hurting me, so I’m not sure how much it would affect her to hear me talk about another girl, but I do NOT want to take any chances and end up hurting her.